; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-28)
(:domain gripper-strips)
(:objects rooma roomb room3 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 )
(:init
(room rooma)
(room roomb)
(room room3)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at-robby rooma)
)
(:goal
(and
(at ball1 room3)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
)
)
)

; plan
1. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 6 of 28
2. (pick ball8 rooma right)
   deleted: (at ball8 rooma) (free right)
   added: (carry ball8 right)
   goals met: 6 of 28
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 6 of 28
4. (drop ball8 room3 right)
   deleted: (carry ball8 right)
   added: (at ball8 room3) (free right)
   goals met: 7 of 28
5. (drop ball9 room3 left)
   deleted: (carry ball9 left)
   added: (at ball9 room3) (free left)
   goals met: 8 of 28
6. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 8 of 28
7. (pick ball22 roomb left)
   deleted: (at ball22 roomb) (free left)
   added: (carry ball22 left)
   goals met: 8 of 28
8. (pick ball21 roomb right)
   deleted: (at ball21 roomb) (free right)
   added: (carry ball21 right)
   goals met: 8 of 28
9. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 8 of 28
10. (drop ball21 room3 right)
   deleted: (carry ball21 right)
   added: (at ball21 room3) (free right)
   goals met: 9 of 28
11. (drop ball22 room3 left)
   deleted: (carry ball22 left)
   added: (at ball22 room3) (free left)
   goals met: 10 of 28
12. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 10 of 28
13. (pick ball20 roomb left)
   deleted: (at ball20 roomb) (free left)
   added: (carry ball20 left)
   goals met: 10 of 28
14. (pick ball19 roomb right)
   deleted: (at ball19 roomb) (free right)
   added: (carry ball19 right)
   goals met: 10 of 28
15. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 10 of 28
16. (drop ball19 room3 right)
   deleted: (carry ball19 right)
   added: (at ball19 room3) (free right)
   goals met: 11 of 28
17. (drop ball20 room3 left)
   deleted: (carry ball20 left)
   added: (at ball20 room3) (free left)
   goals met: 12 of 28
18. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 12 of 28
19. (pick ball18 roomb left)
   deleted: (at ball18 roomb) (free left)
   added: (carry ball18 left)
   goals met: 12 of 28
20. (pick ball17 roomb right)
   deleted: (at ball17 roomb) (free right)
   added: (carry ball17 right)
   goals met: 12 of 28
21. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 12 of 28
22. (drop ball17 room3 right)
   deleted: (carry ball17 right)
   added: (at ball17 room3) (free right)
   goals met: 13 of 28
23. (drop ball18 room3 left)
   deleted: (carry ball18 left)
   added: (at ball18 room3) (free left)
   goals met: 14 of 28
24. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 14 of 28
25. (pick ball16 roomb left)
   deleted: (at ball16 roomb) (free left)
   added: (carry ball16 left)
   goals met: 14 of 28
26. (pick ball15 roomb right)
   deleted: (at ball15 roomb) (free right)
   added: (carry ball15 right)
   goals met: 14 of 28
27. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 14 of 28
28. (drop ball15 room3 right)
   deleted: (carry ball15 right)
   added: (at ball15 room3) (free right)
   goals met: 15 of 28
29. (drop ball16 room3 left)
   deleted: (carry ball16 left)
   added: (at ball16 room3) (free left)
   goals met: 16 of 28
30. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 16 of 28
31. (pick ball14 roomb left)
   deleted: (at ball14 roomb) (free left)
   added: (carry ball14 left)
   goals met: 16 of 28
32. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 16 of 28
33. (drop ball14 room3 left)
   deleted: (carry ball14 left)
   added: (at ball14 room3) (free left)
   goals met: 17 of 28
34. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 17 of 28
35. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 17 of 28
36. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 17 of 28
37. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 17 of 28
38. (drop ball6 room3 right)
   deleted: (carry ball6 right)
   added: (at ball6 room3) (free right)
   goals met: 18 of 28
39. (drop ball7 room3 left)
   deleted: (carry ball7 left)
   added: (at ball7 room3) (free left)
   goals met: 19 of 28
40. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 19 of 28
41. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 19 of 28
42. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 19 of 28
43. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 19 of 28
44. (drop ball4 room3 right)
   deleted: (carry ball4 right)
   added: (at ball4 room3) (free right)
   goals met: 20 of 28
45. (drop ball5 room3 left)
   deleted: (carry ball5 left)
   added: (at ball5 room3) (free left)
   goals met: 21 of 28
46. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 21 of 28
47. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 21 of 28
48. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 21 of 28
49. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 21 of 28
50. (drop ball2 room3 right)
   deleted: (carry ball2 right)
   added: (at ball2 room3) (free right)
   goals met: 22 of 28
51. (drop ball3 room3 left)
   deleted: (carry ball3 left)
   added: (at ball3 room3) (free left)
   goals met: 23 of 28
52. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 23 of 28
53. (pick ball13 rooma left)
   deleted: (at ball13 rooma) (free left)
   added: (carry ball13 left)
   goals met: 23 of 28
54. (pick ball12 rooma right)
   deleted: (at ball12 rooma) (free right)
   added: (carry ball12 right)
   goals met: 23 of 28
55. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 23 of 28
56. (drop ball12 room3 right)
   deleted: (carry ball12 right)
   added: (at ball12 room3) (free right)
   goals met: 24 of 28
57. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 25 of 28
58. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 25 of 28
59. (pick ball11 rooma left)
   deleted: (at ball11 rooma) (free left)
   added: (carry ball11 left)
   goals met: 25 of 28
60. (pick ball10 rooma right)
   deleted: (at ball10 rooma) (free right)
   added: (carry ball10 right)
   goals met: 25 of 28
61. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 25 of 28
62. (drop ball10 room3 right)
   deleted: (carry ball10 right)
   added: (at ball10 room3) (free right)
   goals met: 26 of 28
63. (drop ball11 room3 left)
   deleted: (carry ball11 left)
   added: (at ball11 room3) (free left)
   goals met: 27 of 28
64. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 27 of 28
65. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 27 of 28
66. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 27 of 28
67. (drop ball1 room3 left)
   deleted: (carry ball1 left)
   added: (at ball1 room3) (free left)
   goals met: 28 of 28
